In [1]:
import numpy as np
import pandas as pd
from pandas import Series
from pandas import DataFrame

In [2]:
ser = Series({'A':25, 'B':31, 'C':26},name='scores')

In [3]:
print(ser)

A    25
B    31
C    26
Name: scores, dtype: int64

In [5]:
print(ser.reset_index())

  index  scores
0     A      25
1     B      31
2     C      26

In [17]:
df = DataFrame(np.arange(0,10).reshape(5,2), index=['A','B','C','D','E'])

In [18]:
print(df)

   0  1
A  0  1
B  2  3
C  4  5
D  6  7
E  8  9

In [21]:
df = DataFrame(np.arange(1,9).reshape(4,2), index=['A','B','C','D'])
print(df)
df.loc['B':'D'][0].max()

   0  1
A  1  2
B  3  4
C  5  6
D  7  8

7

In [23]:
df = DataFrame(np.arange(1,25).reshape(4,6))
print(df)

    0   1   2   3   4   5
0   1   2   3   4   5   6
1   7   8   9  10  11  12
2  13  14  15  16  17  18
3  19  20  21  22  23  24

In [24]:
df.iloc[1:]

    0   1   2   3   4   5
1   7   8   9  10  11  12
2  13  14  15  16  17  18
3  19  20  21  22  23  24

In [25]:
df.loc[[1,2,3]]

    0   1   2   3   4   5
1   7   8   9  10  11  12
2  13  14  15  16  17  18
3  19  20  21  22  23  24

In [26]:
df.loc[1:3]

    0   1   2   3   4   5
1   7   8   9  10  11  12
2  13  14  15  16  17  18
3  19  20  21  22  23  24

In [27]:
data = DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Abby'],
   'subject_id':['sub1','sub2','sub3','sub4','sub5']
})

In [28]:
print(data)

   id   Name subject_id
0   1   Alex       sub1
1   2    Amy       sub2
2   3  Allen       sub3
3   4  Alice       sub4
4   5   Abby       sub5

In [37]:
data.T[1:3][2][0]

'Allen'

In [56]:
data = pd.DataFrame({'Univ':['USC', 'Yale', 'Harvard', 'UCLA', 'NCSU', 'NYU'],
                     'IVY':['No', np.nan, 'Yes', np.nan, 'No', np.nan]})
data

      Univ  IVY
0      USC   No
1     Yale  NaN
2  Harvard  Yes
3     UCLA  NaN
4     NCSU   No
5      NYU  NaN

In [57]:
data.loc[data['Univ'] == 'Yale','IVY'] = 'Yes'
data.loc[data['Univ'] == 'NYU','IVY'] = 'No'
data

      Univ  IVY
0      USC   No
1     Yale  Yes
2  Harvard  Yes
3     UCLA  NaN
4     NCSU   No
5      NYU   No

In [71]:
from numpy import nan as NA
nums = pd.Series(np.random.randint(1, 10, 20))
for i in range(5):
    nums[np.random.randint(0, 20, 1)] = NA
nums

0     NaN
1     1.0
2     7.0
3     NaN
4     8.0
5     4.0
6     2.0
7     1.0
8     3.0
9     3.0
10    1.0
11    NaN
12    4.0
13    8.0
14    6.0
15    8.0
16    6.0
17    6.0
18    2.0
19    NaN
dtype: float64

In [76]:
nums[nums.isnull()] = round(nums.mean())
print(nums)
res_nums = nums[nums%3 == 0]
print(res_nums)

0     4.0
1     1.0
2     7.0
3     4.0
4     8.0
5     4.0
6     2.0
7     1.0
8     3.0
9     3.0
10    1.0
11    4.0
12    4.0
13    8.0
14    6.0
15    8.0
16    6.0
17    6.0
18    2.0
19    4.0
dtype: float64
8     3.0
9     3.0
14    6.0
16    6.0
17    6.0
dtype: float64

In [78]:
ser = pd.Series(np.random.randint(1, 6, [12]))
ser

0     1
1     5
2     4
3     5
4     5
5     3
6     1
7     2
8     4
9     5
10    3
11    3
dtype: int32

In [79]:
ser = pd.Series(np.random.randint(1, 6, [12]))
print(ser,'\n')

# compute the value counts and get top 2 (most frequent)
top2freq = ser.value_counts()[:2]
print('Top 2 Freq:\n', top2freq,'\n')

# check for membership of value in index of top 2 frequent values
# negate it for assigning to other
ser[~ser.isin(ser.value_counts().index[:2])] = 'Other'
print(ser)

0     3
1     2
2     4
3     5
4     1
5     1
6     2
7     3
8     5
9     2
10    1
11    1
dtype: int32

Top 2 Freq:
 1    4
2    3
dtype: int64

0     Other
1         2
2     Other
3     Other
4         1
5         1
6         2
7     Other
8     Other
9         2
10        1
11        1
dtype: object

In [82]:
ser = pd.Series(['how', 'to easily', 'learn', 'spoken spanish'])
ser

0               how
1         to easily
2             learn
3    spoken spanish
dtype: object

In [81]:
ser = pd.Series(['how', 'to easily', 'learn', 'spoken spanish'])

# Option 1 (using title)
ser.map(lambda x: x.title())

# Option 2 -> without using title 
def titleit(x):
    str=''
    for w in x.split():
        str += ' ' + w[0].upper() + w[1:].lower()
    return str

ser.map(titleit)

# Option 3 -> without using map
pd.Series([i.title() for i in ser])